--- a/vendor/github.com/grafana/dskit/services/README.md
+++ b/vendor/github.com/grafana/dskit/services/README.md
@@ -1,90 +1,94 @@
 
 Full state diagram:
 
-```text
-   ┌────────────────────────────────────────────────────────────────────┐
-   │                                                                    │
-   │                                                                    ▼
-┌─────┐      ┌──────────┐      ┌─────────┐     ┌──────────┐      ┌────────────┐
-│ New │─────▶│ Starting │─────▶│ Running │────▶│ Stopping │───┬─▶│ Terminated │
-└─────┘      └──────────┘      └─────────┘     └──────────┘   │  └────────────┘
-                   │                                          │
-                   │                                          │
-                   │                                          │   ┌────────┐
-                   └──────────────────────────────────────────┴──▶│ Failed │
-                                                                  └────────┘
+
+```mermaid
+flowchart LR
+  new[New]
+  starting[Starting]
+  running[Running]
+  stopping[Stopping]
+  terminated[Terminated]
+  failed[Failed]
+  new --> starting --> running --> stopping --> terminated
+  new --> terminated
+  starting --> failed
+  running --> failed
+  stopping --> failed
+	
 ```
 
-API and states and semantics are implemented to correspond to [Service class](https://guava.dev/releases/snapshot/api/docs/com/google/common/util/concurrent/Service.html) in Guava library.
+The API, states, and semantics are implemented to correspond to the [Service class](https://guava.dev/releases/snapshot/api/docs/com/google/common/util/concurrent/Service.html) in the Guava library.
